Tekla Open API Reference for Tekla Structures 2025
Edge.Clone Method
 Method for cloning the current object.
 Namespace: Tekla.Structures.Solid
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Object Clone()
Public Function Clone As Object
Return Value
Type: Object
Cloned object.
Implements
ICloneable.Clone()
See Also
Reference
Edge Class
Tekla.Structures.Solid Namespace